CRUD stands for Create, Read, Update and Delete. These are the four fundamental operations we'll use when working with data in Pandas. Whether we're creating a DataFrame from scratch, analyzing existing data, modifying values or saving our results these operations are important in Pandas.

Let’s see each operation step by step to see how they make data manipulation easy.

### 1. Create: Creating Dataframe
Creating a dataset in Pandas means building a DataFrame which is the main data structure in Pandas. We can create a DataFrame using various methods like reading from a file or directly creating one from Python objects like dictionaries, lists or arrays

#### 1. Creating a DataFrame from a Dictationary

This is one of the easiest and most commonly used methods to create a dataset in Pandas

In [1]:
import pandas as pd
data = {
    "Name": ["Ansh", "Sahil", "Ram"],
    "Age": [21, 20, 41],
    "City": ["Moradabad", "New Delhi", "Chennai"]
}
df = pd.DataFrame(data)
print(df)

    Name  Age       City
0   Ansh   21  Moradabad
1  Sahil   20  New Delhi
2    Ram   41    Chennai

#### 2. Creating a DataFrame from Lists

We can also create a DataFrame by combining lists.

In [4]:
names = ["Akshit", "Uday", "Sam"]
ages = [25, 30, 35]
cities = ["Gurugram", "New Delhi", "Chicago"]

df = pd.DataFrame({
    "Name": names,
    "Age": ages,
    "City": cities
})

df

     Name  Age       City
0  Akshit   25   Gurugram
1    Uday   30  New Delhi
2     Sam   35    Chicago

#### 3. Creating a DataFrame from a CSV File

We can also create a DataFrame by reading an external file like a CSV. Here we used the random car.csv data.

In [5]:
df=pd.read_csv("CAR.csv")
df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

2. Read: Reading Dataframe
Now that we’ve created a dataset using the Create operation, lets see by using the Read operation. This step is all about accessing and understanding our data. Pandas provides simple methods to view our dataset, check its structure and analyze its contents.

1. Viewing Rows in a DataFrame

head(n): Displaying the First Few Rows
tail(n): Displaying the Last Few Rows